#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(АктВыполненыхРабот)
	ТабДок = Новый ТабличныйДокумент;
	АктВыполненыхРабот(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура АктВыполненыхРабот(ТабДок, ПараметрКоманды)
	Документы.Реализация.АктВыполненыхРабот(ТабДок, ПараметрКоманды);
КонецПроцедуры

#КонецОбласти