Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
    // Получаем родителя (группу)
	Родитель = ЭтотОбъект.Родитель;
    
    // Если родитель не определен, проверять не нужно
	Если Родитель = Справочники.Номенклатура.ПустаяСсылка() Тогда
		Возврат;
	КонецЕсли;
    
    // Проверяем, является ли родитель одной из предопределенных групп
	Если Родитель = Справочники.Номенклатура.Товары Или Родитель = Справочники.Номенклатура.Услуги Или Родитель
		= Справочники.Номенклатура.МатериалыСобственные Или Родитель = Справочники.Номенклатура.МатериалыКлиента Тогда
        
        // Определяем допустимый тип для данной группы
		ДопустимыйТип = Неопределено;
		Если Родитель = Справочники.Номенклатура.Товары Тогда
			ДопустимыйТип = Перечисления.ТипыНоменклатуры.Товар;
		ИначеЕсли Родитель = Справочники.Номенклатура.Услуги Тогда
			ДопустимыйТип = Перечисления.ТипыНоменклатуры.Услуга;
		ИначеЕсли Родитель = Справочники.Номенклатура.МатериалыСобственные Тогда
			ДопустимыйТип = Перечисления.ТипыНоменклатуры.Материал;
		ИначеЕсли Родитель = Справочники.Номенклатура.МатериалыКлиента Тогда
			ДопустимыйТип = Перечисления.ТипыНоменклатуры.МатериалКлиента;
		КонецЕсли;
        
        // Сравниваем
		Если ЭтотОбъект.ТипНоменклатуры <> ДопустимыйТип Тогда
			Сообщить("Ошибка: в группе """ + Родитель.Наименование + """ можно создавать элементы только с типом """
				+ Строка(ДопустимыйТип) + """.");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры